//Точка в квадрате
//
//Напишите программу, которая определяет, принадлежат ли случайно введенные пользователем точки плоскости квадрата или не принадлежат.
//
//Изначально вводится 8 чисел - координаты вершин квадрата - вещественные числа (каждое с новой строки) - X1, Y1, X2, Y2, X3, Y3, X4, Y4
//
//После чего вводится число n ∈ N - количество исследуемых точек.
//
//Затем на 2n строках идут координаты точек (сначала вводится координата X , затем с новой строки Y и т.д.) - x1, y1, x2, y2, ...., xn, yn
//
//В результате необходимо вывести следующее сообщение после ввода каждой точки - "Точка с координатами [X,Y] принадлежит исследуемому квадрату" или "Точка с координатами [X,Y] не принадлежит исследуемому квадрату".

package main
